       01 FD-REG-EMPRESA.
           03 FRE-TIPO-REGISTRO          PIC 9.
           03 FRE-INDICADOR-FULL-DIARIO  PIC X.
           03 FRE-TIPO-ATUALIZACAO       PIC X.
		   03 FRE-CNPJ-ID.
              05 FRE-CNPJ                PIC 9(014).
           03 FRE-CNAE-SECUNDARIA        PIC 9(007).
		   03 FILLER                     PIC X(489).
		   03 FRS-FIM-REGISTRO           PIC X.
		   